# Dotfiles Brewfile
# Install with: brew bundle

# Essential CLI Tools
# -------------------

# Search & Navigation
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Better grep
brew "fd"           # Better find
brew "zoxide"       # Smart cd

# Modern Replacements
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Better ls with icons & git status
brew "tldr"         # Simplified man pages

# Dev Tools
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "httpie"       # User-friendly HTTP client
brew "gh"           # GitHub CLI

# System Utils
brew "htop"         # Process viewer
brew "tree"         # Directory visualization

# Version Management
brew "nvm"          # Node version manager
brew "uv"           # Fast Python package installer & version manager

# Git & Security
brew "gpg"          # GPG for commit signing
brew "git"          # Git (latest version)

# Optional: Productivity
brew "tmux"       # Terminal multiplexer
